[Killed] BlockStatement
src/index.ts:20:46
   delete: (key: string) => Promise<void>;
 }
 
-export function createNodeClock(): CoreClock {
-  return {
-    now: () => Date.now(),
-  };
-}
+export function createNodeClock(): CoreClock {}
 
 export function createConsoleLogger(name = 'node-logger'): CoreLogger {
killedBy: All tests
statusReason: > @oaknational/mcp-providers-node@0.0.0-development test
> vitest run




 RUN  v3.2.4 /Users/jim/code/oak/ai_experiments/oak-mcp-ecosystem/packages/providers/mcp-providers-node/.stryker-tmp/sandbox-YutsCe

[Killed] ArrowFunction
src/index.ts:22:10
 
 export function createNodeClock(): CoreClock {
   return {
-    now: () => Date.now(),
+    now: () => undefined,
   };
 }
killedBy: All tests
statusReason: > @oaknational/mcp-providers-node@0.0.0-development test
> vitest run




 RUN  v3.2.4 /Users/jim/code/oak/ai_experiments/oak-mcp-ecosystem/packages/providers/mcp-providers-node/.stryker-tmp/sandbox-YutsCe

[Killed] BlockStatement
src/index.ts:26:71
   };
 }
 
-export function createConsoleLogger(name = 'node-logger'): CoreLogger {
-  return {
-    debug: (message, context) => {
-      console.debug(`[${name}] DEBUG: ${message}`, context ?? '');
-    },
-    info: (message, context) => {
-      console.info(`[${name}] INFO: ${message}`, context ?? '');
-    },
-    warn: (message, context) => {
-      console.warn(`[${name}] WARN: ${message}`, context ?? '');
-    },
-    error: (message, context) => {
-      console.error(`[${name}] ERROR: ${message}`, context ?? '');
-    },
-  };
-}
+export function createConsoleLogger(name = 'node-logger'): CoreLogger {}
 
 export function createInMemoryStorage(): CoreStorage {
killedBy: All tests
statusReason: > @oaknational/mcp-providers-node@0.0.0-development test
> vitest run



 RUN  v3.2.4 /Users/jim/code/oak/ai_experiments/oak-mcp-ecosystem/packages/providers/mcp-providers-node/.stryker-tmp/sandbox-YutsCe

[Killed] BlockStatement
src/index.ts:28:34
 
 export function createConsoleLogger(name = 'node-logger'): CoreLogger {
   return {
-    debug: (message, context) => {
-      console.debug(`[${name}] DEBUG: ${message}`, context ?? '');
-    },
+    debug: (message, context) => {},
     info: (message, context) => {
       console.info(`[${name}] INFO: ${message}`, context ?? '');
killedBy: All tests
statusReason: > @oaknational/mcp-providers-node@0.0.0-development test
> vitest run



 RUN  v3.2.4 /Users/jim/code/oak/ai_experiments/oak-mcp-ecosystem/packages/providers/mcp-providers-node/.stryker-tmp/sandbox-YutsCe

[Survived] LogicalOperator
src/index.ts:29:52
 export function createConsoleLogger(name = 'node-logger'): CoreLogger {
   return {
     debug: (message, context) => {
-      console.debug(`[${name}] DEBUG: ${message}`, context ?? '');
+      console.debug(`[${name}] DEBUG: ${message}`, context && '');
     },
     info: (message, context) => {

[Killed] BlockStatement
src/index.ts:31:33
     debug: (message, context) => {
       console.debug(`[${name}] DEBUG: ${message}`, context ?? '');
     },
-    info: (message, context) => {
-      console.info(`[${name}] INFO: ${message}`, context ?? '');
-    },
+    info: (message, context) => {},
     warn: (message, context) => {
       console.warn(`[${name}] WARN: ${message}`, context ?? '');
killedBy: All tests
statusReason: > @oaknational/mcp-providers-node@0.0.0-development test
> vitest run




 RUN  v3.2.4 /Users/jim/code/oak/ai_experiments/oak-mcp-ecosystem/packages/providers/mcp-providers-node/.stryker-tmp/sandbox-YutsCe

[Survived] LogicalOperator
src/index.ts:32:50
       console.debug(`[${name}] DEBUG: ${message}`, context ?? '');
     },
     info: (message, context) => {
-      console.info(`[${name}] INFO: ${message}`, context ?? '');
+      console.info(`[${name}] INFO: ${message}`, context && '');
     },
     warn: (message, context) => {

[Killed] BlockStatement
src/index.ts:34:33
     info: (message, context) => {
       console.info(`[${name}] INFO: ${message}`, context ?? '');
     },
-    warn: (message, context) => {
-      console.warn(`[${name}] WARN: ${message}`, context ?? '');
-    },
+    warn: (message, context) => {},
     error: (message, context) => {
       console.error(`[${name}] ERROR: ${message}`, context ?? '');
killedBy: All tests
statusReason: > @oaknational/mcp-providers-node@0.0.0-development test
> vitest run




 RUN  v3.2.4 /Users/jim/code/oak/ai_experiments/oak-mcp-ecosystem/packages/providers/mcp-providers-node/.stryker-tmp/sandbox-YutsCe

[Survived] LogicalOperator
src/index.ts:35:50
       console.info(`[${name}] INFO: ${message}`, context ?? '');
     },
     warn: (message, context) => {
-      console.warn(`[${name}] WARN: ${message}`, context ?? '');
+      console.warn(`[${name}] WARN: ${message}`, context && '');
     },
     error: (message, context) => {

[Killed] BlockStatement
src/index.ts:37:34
     warn: (message, context) => {
       console.warn(`[${name}] WARN: ${message}`, context ?? '');
     },
-    error: (message, context) => {
-      console.error(`[${name}] ERROR: ${message}`, context ?? '');
-    },
+    error: (message, context) => {},
   };
 }
killedBy: All tests
statusReason: > @oaknational/mcp-providers-node@0.0.0-development test
> vitest run



 RUN  v3.2.4 /Users/jim/code/oak/ai_experiments/oak-mcp-ecosystem/packages/providers/mcp-providers-node/.stryker-tmp/sandbox-YutsCe

[Survived] LogicalOperator
src/index.ts:38:52
       console.warn(`[${name}] WARN: ${message}`, context ?? '');
     },
     error: (message, context) => {
-      console.error(`[${name}] ERROR: ${message}`, context ?? '');
+      console.error(`[${name}] ERROR: ${message}`, context && '');
     },
   };

[Survived] StringLiteral
src/index.ts:38:21
       console.warn(`[${name}] WARN: ${message}`, context ?? '');
     },
     error: (message, context) => {
-      console.error(`[${name}] ERROR: ${message}`, context ?? '');
+      console.error(``, context ?? '');
     },
   };

[Killed] BlockStatement
src/index.ts:43:54
   };
 }
 
-export function createInMemoryStorage(): CoreStorage {
-  const store = new Map<string, string>();
-  return {
-    get(key: string) {
-      return Promise.resolve(store.get(key) ?? null);
-    },
-    set(key: string, value: string) {
-      store.set(key, value);
-      return Promise.resolve();
-    },
-    delete(key: string) {
-      store.delete(key);
-      return Promise.resolve();
-    },
-  };
-}
+export function createInMemoryStorage(): CoreStorage {}
 
killedBy: All tests
statusReason: > @oaknational/mcp-providers-node@0.0.0-development test
> vitest run




 RUN  v3.2.4 /Users/jim/code/oak/ai_experiments/oak-mcp-ecosystem/packages/providers/mcp-providers-node/.stryker-tmp/sandbox-YutsCe

[Killed] ObjectLiteral
src/index.ts:45:10
 
 export function createInMemoryStorage(): CoreStorage {
   const store = new Map<string, string>();
-  return {
-    get(key: string) {
-      return Promise.resolve(store.get(key) ?? null);
-    },
-    set(key: string, value: string) {
-      store.set(key, value);
-      return Promise.resolve();
-    },
-    delete(key: string) {
-      store.delete(key);
-      return Promise.resolve();
-    },
-  };
+  return {};
 }
 
killedBy: All tests
statusReason: > @oaknational/mcp-providers-node@0.0.0-development test
> vitest run



 RUN  v3.2.4 /Users/jim/code/oak/ai_experiments/oak-mcp-ecosystem/packages/providers/mcp-providers-node/.stryker-tmp/sandbox-YutsCe

[Killed] BlockStatement
src/index.ts:46:22
 export function createInMemoryStorage(): CoreStorage {
   const store = new Map<string, string>();
   return {
-    get(key: string) {
-      return Promise.resolve(store.get(key) ?? null);
-    },
+    get(key: string) {},
     set(key: string, value: string) {
       store.set(key, value);
killedBy: All tests
statusReason: > @oaknational/mcp-providers-node@0.0.0-development test
> vitest run



 RUN  v3.2.4 /Users/jim/code/oak/ai_experiments/oak-mcp-ecosystem/packages/providers/mcp-providers-node/.stryker-tmp/sandbox-YutsCe

[Killed] LogicalOperator
src/index.ts:47:30
   const store = new Map<string, string>();
   return {
     get(key: string) {
-      return Promise.resolve(store.get(key) ?? null);
+      return Promise.resolve(store.get(key) && null);
     },
     set(key: string, value: string) {
killedBy: All tests
statusReason: > @oaknational/mcp-providers-node@0.0.0-development test
> vitest run




 RUN  v3.2.4 /Users/jim/code/oak/ai_experiments/oak-mcp-ecosystem/packages/providers/mcp-providers-node/.stryker-tmp/sandbox-YutsCe

[Killed] BlockStatement
src/index.ts:49:37
     get(key: string) {
       return Promise.resolve(store.get(key) ?? null);
     },
-    set(key: string, value: string) {
-      store.set(key, value);
-      return Promise.resolve();
-    },
+    set(key: string, value: string) {},
     delete(key: string) {
       store.delete(key);
killedBy: All tests
statusReason: > @oaknational/mcp-providers-node@0.0.0-development test
> vitest run



 RUN  v3.2.4 /Users/jim/code/oak/ai_experiments/oak-mcp-ecosystem/packages/providers/mcp-providers-node/.stryker-tmp/sandbox-YutsCe

[Killed] BlockStatement
src/index.ts:53:25
       store.set(key, value);
       return Promise.resolve();
     },
-    delete(key: string) {
-      store.delete(key);
-      return Promise.resolve();
-    },
+    delete(key: string) {},
   };
 }
killedBy: All tests
statusReason: > @oaknational/mcp-providers-node@0.0.0-development test
> vitest run




 RUN  v3.2.4 /Users/jim/code/oak/ai_experiments/oak-mcp-ecosystem/packages/providers/mcp-providers-node/.stryker-tmp/sandbox-YutsCe
